guides/cursor/baselines/gin_pprof_runs/k6_gin_20260618_010721.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: load_test_pprof.js
        output: -

     scenarios: (100.00%) 1 scenario, 48 max VUs, 1m5s max duration (incl. graceful stop):
              * steady: 48 looping VUs for 35s (gracefulStop: 30s)

time="2026-06-18T01:07:26+05:30" level=info msg="pprof load: 48 VUs × 35s, scenario=tagged_ecdsa" source=console

running (0m01.0s), 48/48 VUs, 1096 complete and 0 interrupted iterations
steady   [   3% ] 48 VUs  01.0s/35s

running (0m02.1s), 48/48 VUs, 2183 complete and 0 interrupted iterations
steady   [   6% ] 48 VUs  02.0s/35s

running (0m03.0s), 48/48 VUs, 3491 complete and 0 interrupted iterations
steady   [   9% ] 48 VUs  03.0s/35s

running (0m04.0s), 48/48 VUs, 4272 complete and 0 interrupted iterations
steady   [  11% ] 48 VUs  04.0s/35s

running (0m05.0s), 48/48 VUs, 5838 complete and 0 interrupted iterations
steady   [  14% ] 48 VUs  05.0s/35s

running (0m06.0s), 48/48 VUs, 6751 complete and 0 interrupted iterations
steady   [  17% ] 48 VUs  06.0s/35s

running (0m07.0s), 48/48 VUs, 7927 complete and 0 interrupted iterations
steady   [  20% ] 48 VUs  07.0s/35s

running (0m08.0s), 48/48 VUs, 9127 complete and 0 interrupted iterations
steady   [  23% ] 48 VUs  08.0s/35s

running (0m09.0s), 48/48 VUs, 10481 complete and 0 interrupted iterations
steady   [  26% ] 48 VUs  09.0s/35s

running (0m10.0s), 48/48 VUs, 11993 complete and 0 interrupted iterations
steady   [  29% ] 48 VUs  10.0s/35s

running (0m11.0s), 48/48 VUs, 13455 complete and 0 interrupted iterations
steady   [  31% ] 48 VUs  11.0s/35s

running (0m12.0s), 48/48 VUs, 14646 complete and 0 interrupted iterations
steady   [  34% ] 48 VUs  12.0s/35s

running (0m13.0s), 48/48 VUs, 15731 complete and 0 interrupted iterations
steady   [  37% ] 48 VUs  13.0s/35s

running (0m14.0s), 48/48 VUs, 17066 complete and 0 interrupted iterations
steady   [  40% ] 48 VUs  14.0s/35s

running (0m15.0s), 48/48 VUs, 18534 complete and 0 interrupted iterations
steady   [  43% ] 48 VUs  15.0s/35s

running (0m16.0s), 48/48 VUs, 20070 complete and 0 interrupted iterations
steady   [  46% ] 48 VUs  16.0s/35s

running (0m17.0s), 48/48 VUs, 21429 complete and 0 interrupted iterations
steady   [  49% ] 48 VUs  17.0s/35s

running (0m18.0s), 48/48 VUs, 22656 complete and 0 interrupted iterations
steady   [  51% ] 48 VUs  18.0s/35s

running (0m19.0s), 48/48 VUs, 23884 complete and 0 interrupted iterations
steady   [  54% ] 48 VUs  19.0s/35s

running (0m20.0s), 48/48 VUs, 25047 complete and 0 interrupted iterations
steady   [  57% ] 48 VUs  20.0s/35s

running (0m21.0s), 48/48 VUs, 26360 complete and 0 interrupted iterations
steady   [  60% ] 48 VUs  21.0s/35s

running (0m22.0s), 48/48 VUs, 27779 complete and 0 interrupted iterations
steady   [  63% ] 48 VUs  22.0s/35s

running (0m23.0s), 48/48 VUs, 29077 complete and 0 interrupted iterations
steady   [  66% ] 48 VUs  23.0s/35s

running (0m24.0s), 48/48 VUs, 30429 complete and 0 interrupted iterations
steady   [  69% ] 48 VUs  24.0s/35s

running (0m25.0s), 48/48 VUs, 31844 complete and 0 interrupted iterations
steady   [  71% ] 48 VUs  25.0s/35s

running (0m26.0s), 48/48 VUs, 33411 complete and 0 interrupted iterations
steady   [  74% ] 48 VUs  26.0s/35s

running (0m27.0s), 48/48 VUs, 34561 complete and 0 interrupted iterations
steady   [  77% ] 48 VUs  27.0s/35s

running (0m28.0s), 48/48 VUs, 35908 complete and 0 interrupted iterations
steady   [  80% ] 48 VUs  28.0s/35s

running (0m29.0s), 48/48 VUs, 37293 complete and 0 interrupted iterations
steady   [  83% ] 48 VUs  29.0s/35s

running (0m30.0s), 48/48 VUs, 38495 complete and 0 interrupted iterations
steady   [  86% ] 48 VUs  30.0s/35s

running (0m31.0s), 48/48 VUs, 39853 complete and 0 interrupted iterations
steady   [  89% ] 48 VUs  31.0s/35s

running (0m32.0s), 48/48 VUs, 41340 complete and 0 interrupted iterations
steady   [  91% ] 48 VUs  32.0s/35s

running (0m33.0s), 48/48 VUs, 42735 complete and 0 interrupted iterations
steady   [  94% ] 48 VUs  33.0s/35s

running (0m34.0s), 48/48 VUs, 43963 complete and 0 interrupted iterations
steady   [  97% ] 48 VUs  34.0s/35s

running (0m35.0s), 48/48 VUs, 45107 complete and 0 interrupted iterations
steady   [ 100% ] 48 VUs  35.0s/35s
time="2026-06-18T01:08:01+05:30" level=info msg="pprof load done (started 2026-06-17T19:37:26.556Z)" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.05' rate=0.00%

    http_req_duration
    ✓ 'p(99)<5000' p(99)=547.49ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 90352   2562.642956/s
    checks_succeeded...: 100.00% 90352 out of 90352
    checks_failed......: 0.00%   0 out of 90352

    ✓ status is 200
    ✓ response has content

    CUSTOM
    active_latency.................: avg=8.903674   min=2       med=6      max=164      p(90)=17      p(95)=23      p(99)=38      
    errors.........................: 0.00%  0 out of 45176
    hft_latency....................: avg=508.816584 min=149     med=513    max=1019     p(90)=680     p(95)=727     p(99)=829.46  
    pdf_generation_time............: avg=30.631353  min=1       med=4      max=1019     p(90)=17      p(95)=84      p(99)=617     
    retail_latency.................: avg=5.367796   min=1       med=3      max=239      p(90)=11      p(95)=16      p(99)=32      

    HTTP
    http_req_duration..............: avg=26.21ms    min=331.6µs med=3.21ms max=924.18ms p(90)=15.31ms p(95)=68.31ms p(99)=547.49ms
      { expected_response:true }...: avg=26.21ms    min=331.6µs med=3.21ms max=924.18ms p(90)=15.31ms p(95)=68.31ms p(99)=547.49ms
    http_req_failed................: 0.00%  0 out of 45177
    http_reqs......................: 45177  1281.349841/s

    EXECUTION
    iteration_duration.............: avg=37.31ms    min=1.55ms  med=5.43ms max=1.16s    p(90)=20.82ms p(95)=99.36ms p(99)=721.3ms 
    iterations.....................: 45176  1281.321478/s
    vus............................: 48     min=48         max=48
    vus_max........................: 48     min=48         max=48

    NETWORK
    data_received..................: 4.3 GB 122 MB/s
    data_sent......................: 3.0 GB 84 MB/s



running (0m35.3s), 00/48 VUs, 45176 complete and 0 interrupted iterations
steady ✓ [ 100% ] 48 VUs  35s